0xsmirk/mcu_cmsis_svd/Spansion/MB9BF46xx.svd
        <!-- REGISTER "REVC1" -->
        <register>
          <name>REVC1</name>
          <description> register REVC1 </description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV23" -->
            <field>
              <name>REV23</name>
              <description> bitfield REV23 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV22" -->
            <field>
              <name>REV22</name>
              <description> bitfield REV22 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV21" -->
            <field>
              <name>REV21</name>
              <description> bitfield REV21 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV20" -->
            <field>
              <name>REV20</name>
              <description> bitfield REV20 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV19" -->
            <field>
              <name>REV19</name>
              <description> bitfield REV19 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV18" -->
            <field>
              <name>REV18</name>
              <description> bitfield REV18 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV17" -->
            <field>
              <name>REV17</name>
              <description> bitfield REV17 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV16" -->
            <field>
              <name>REV16</name>
              <description> bitfield REV16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC0" -->
        <register>
          <name>PPGC0</name>
          <description> register PPGC0 </description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description> bitfield PIE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description> bitfield PUF </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description> bitfield INTM </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description> bitfield PCS </description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description> bitfield MD </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTRG" -->
            <field>
              <name>TTRG</name>
              <description> bitfield TTRG </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC1" -->
        <register derivedFrom="PPGC0">
          <name>PPGC1</name>
          <description> register PPGC1 </description>
          <addressOffset>0x200</addressOffset>
        </register>
        <!-- REGISTER "PPGC2" -->
        <register derivedFrom="PPGC0">
          <name>PPGC2</name>
          <description> register PPGC2 </description>
          <addressOffset>0x205</addressOffset>
        </register>
        <!-- REGISTER "PPGC3" -->
        <register derivedFrom="PPGC0">
          <name>PPGC3</name>
          <description> register PPGC3 </description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "PPGC4" -->
        <register derivedFrom="PPGC0">
          <name>PPGC4</name>
          <description> register PPGC4 </description>
          <addressOffset>0x241</addressOffset>
        </register>
        <!-- REGISTER "PPGC5" -->
        <register derivedFrom="PPGC0">
          <name>PPGC5</name>
          <description> register PPGC5 </description>
          <addressOffset>0x240</addressOffset>
        </register>
        <!-- REGISTER "PPGC6" -->
        <register derivedFrom="PPGC0">
          <name>PPGC6</name>
          <description> register PPGC6 </description>
          <addressOffset>0x245</addressOffset>
        </register>
        <!-- REGISTER "PPGC7" -->
        <register derivedFrom="PPGC0">
          <name>PPGC7</name>
          <description> register PPGC7 </description>
          <addressOffset>0x244</addressOffset>
        </register>
        <!-- REGISTER "PPGC8" -->
        <register derivedFrom="PPGC0">
          <name>PPGC8</name>
          <description> register PPGC8 </description>
          <addressOffset>0x281</addressOffset>
        </register>
        <!-- REGISTER "PPGC9" -->
        <register derivedFrom="PPGC0">
          <name>PPGC9</name>
          <description> register PPGC9 </description>
          <addressOffset>0x280</addressOffset>
        </register>
        <!-- REGISTER "PPGC10" -->
        <register derivedFrom="PPGC0">
          <name>PPGC10</name>
          <description> register PPGC10 </description>
          <addressOffset>0x285</addressOffset>
        </register>
        <!-- REGISTER "PPGC11" -->
        <register derivedFrom="PPGC0">
          <name>PPGC11</name>
          <description> register PPGC11 </description>
          <addressOffset>0x284</addressOffset>
        </register>
        <!-- REGISTER "PPGC12" -->
        <register derivedFrom="PPGC0">
          <name>PPGC12</name>
          <description> register PPGC12 </description>
          <addressOffset>0x2C1</addressOffset>
        </register>
