0xsmirk/mcu_cmsis_svd/Spansion/MB9BF46xx.svd
        <!-- REGISTER "IRQ003SEL" -->
        <register>
          <name>IRQ003SEL</name>
          <description> register IRQ003SEL </description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ004SEL" -->
        <register>
          <name>IRQ004SEL</name>
          <description> register IRQ004SEL </description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ005SEL" -->
        <register>
          <name>IRQ005SEL</name>
          <description> register IRQ005SEL </description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ006SEL" -->
        <register>
          <name>IRQ006SEL</name>
          <description> register IRQ006SEL </description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ007SEL" -->
        <register>
          <name>IRQ007SEL</name>
          <description> register IRQ007SEL </description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ008SEL" -->
        <register>
          <name>IRQ008SEL</name>
          <description> register IRQ008SEL </description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ009SEL" -->
        <register>
          <name>IRQ009SEL</name>
          <description> register IRQ009SEL </description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ010SEL" -->
        <register>
          <name>IRQ010SEL</name>
          <description> register IRQ010SEL </description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description> bitfield SELBIT </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description> bitfield SELIRQ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EXC02MON" -->
        <register>
          <name>EXC02MON</name>
          <description> register EXC02MON </description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWINT" -->
            <field>
              <name>HWINT</name>
              <description> bitfield HWINT </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMI" -->
            <field>
              <name>NMI</name>
              <description> bitfield NMI </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ000MON" -->
        <register>
          <name>IRQ000MON</name>
          <description> register IRQ000MON </description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSINT" -->
            <field>
              <name>FCSINT</name>
              <description> bitfield FCSINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ001MON" -->
        <register>
          <name>IRQ001MON</name>
          <description> register IRQ001MON </description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWWDTINT" -->
            <field>
              <name>SWWDTINT</name>
              <description> bitfield SWWDTINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ002MON" -->
        <register>
          <name>IRQ002MON</name>
          <description> register IRQ002MON </description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDINT" -->
            <field>
              <name>LVDINT</name>
              <description> bitfield LVDINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
