0xsmirk/mcu_cmsis_svd/Spansion/MB9BF46xx.svd
        <!-- REGISTER "IRQ115MON" -->
        <register>
          <name>IRQ115MON</name>
          <description> register IRQ115MON </description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ116MON" -->
        <register>
          <name>IRQ116MON</name>
          <description> register IRQ116MON </description>
          <addressOffset>0x3D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ117MON" -->
        <register>
          <name>IRQ117MON</name>
          <description> register IRQ117MON </description>
          <addressOffset>0x3D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ118MON" -->
        <register>
          <name>IRQ118MON</name>
          <description> register IRQ118MON </description>
          <addressOffset>0x3DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDINT1" -->
            <field>
              <name>SDINT1</name>
              <description> bitfield SDINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDINT0" -->
            <field>
              <name>SDINT0</name>
              <description> bitfield SDINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ119MON" -->
        <register>
          <name>IRQ119MON</name>
          <description> register IRQ119MON </description>
          <addressOffset>0x3E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLINT" -->
            <field>
              <name>FLINT</name>
              <description> bitfield FLINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ120MON" -->
        <register>
          <name>IRQ120MON</name>
          <description> register IRQ120MON </description>
          <addressOffset>0x3E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ121MON" -->
        <register>
          <name>IRQ121MON</name>
          <description> register IRQ121MON </description>
          <addressOffset>0x3E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ122MON" -->
        <register>
          <name>IRQ122MON</name>
          <description> register IRQ122MON </description>
          <addressOffset>0x3EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ123MON" -->
        <register>
          <name>IRQ123MON</name>
          <description> register IRQ123MON </description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ124MON" -->
        <register>
          <name>IRQ124MON</name>
          <description> register IRQ124MON </description>
          <addressOffset>0x3F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ125MON" -->
        <register>
          <name>IRQ125MON</name>
          <description> register IRQ125MON </description>
          <addressOffset>0x3F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ126MON" -->
        <register>
          <name>IRQ126MON</name>
          <description> register IRQ126MON </description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ127MON" -->
        <register>
          <name>IRQ127MON</name>
          <description> register IRQ127MON </description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
