0xsmirk/mcu_cmsis_svd/Spansion/MB9BF46xx.svd
        <!-- REGISTER "I2C_FCR0" -->
        <register>
          <name>I2C_FCR0</name>
          <description> register I2C_FCR0 </description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description> bitfield FLST </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLD" -->
            <field>
              <name>FLD</name>
              <description> bitfield FLD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSET" -->
            <field>
              <name>FSET</name>
              <description> bitfield FSET </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description> bitfield FCL2 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description> bitfield FCL1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description> bitfield FE2 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description> bitfield FE1 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_FBYTE1" -->
        <register>
          <name>I2C_FBYTE1</name>
          <description> register I2C_FBYTE1 </description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "I2C_FBYTE2" -->
        <register>
          <name>I2C_FBYTE2</name>
          <description> register I2C_FBYTE2 </description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "I2C_NFCR" -->
        <register>
          <name>I2C_NFCR</name>
          <description> register I2C_NFCR </description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NFT" -->
            <field>
              <name>NFT</name>
              <description> bitfield NFT </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_EIBCR" -->
        <register>
          <name>I2C_EIBCR</name>
          <description> register I2C_EIBCR </description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDAS" -->
            <field>
              <name>SDAS</name>
              <description> bitfield SDAS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLS" -->
            <field>
              <name>SCLS</name>
              <description> bitfield SCLS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDAC" -->
            <field>
              <name>SDAC</name>
              <description> bitfield SDAC </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLC" -->
            <field>
              <name>SCLC</name>
              <description> bitfield SCLC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOCE" -->
            <field>
              <name>SOCE</name>
              <description> bitfield SOCE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description> bitfield BEC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS1" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS1</name>
      <baseAddress>0x40038100</baseAddress>
      <!-- INTERRUPT "MFS1_RX" -->
      <interrupt>
        <name>MFS1_RX</name>
        <value>62</value>
      </interrupt>
      <!-- INTERRUPT "MFS1_TX" -->
      <interrupt>
        <name>MFS1_TX</name>
        <value>63</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS2" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS2</name>
      <baseAddress>0x40038200</baseAddress>
      <!-- INTERRUPT "MFS2_RX" -->
      <interrupt>
        <name>MFS2_RX</name>
        <value>64</value>
      </interrupt>
      <!-- INTERRUPT "MFS2_TX" -->
      <interrupt>
        <name>MFS2_TX</name>
        <value>65</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS3" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS3</name>
      <baseAddress>0x40038300</baseAddress>
      <!-- INTERRUPT "MFS3_RX" -->
      <interrupt>
        <name>MFS3_RX</name>
        <value>66</value>
      </interrupt>
      <!-- INTERRUPT "MFS3_TX" -->
      <interrupt>
        <name>MFS3_TX</name>
        <value>67</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS4" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS4</name>
      <baseAddress>0x40038400</baseAddress>
      <!-- INTERRUPT "MFS4_RX" -->
      <interrupt>
        <name>MFS4_RX</name>
        <value>68</value>
      </interrupt>
      <!-- INTERRUPT "MFS4_TX" -->
      <interrupt>
        <name>MFS4_TX</name>
        <value>69</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS5" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS5</name>
      <baseAddress>0x40038500</baseAddress>
      <!-- INTERRUPT "MFS5_RX" -->
      <interrupt>
        <name>MFS5_RX</name>
        <value>70</value>
      </interrupt>
      <!-- INTERRUPT "MFS5_TX" -->
      <interrupt>
        <name>MFS5_TX</name>
        <value>71</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS6</name>
      <baseAddress>0x40038600</baseAddress>
      <!-- INTERRUPT "MFS6_RX" -->
      <interrupt>
        <name>MFS6_RX</name>
        <value>72</value>
      </interrupt>
      <!-- INTERRUPT "MFS6_TX" -->
      <interrupt>
        <name>MFS6_TX</name>
        <value>73</value>
      </interrupt>
    </peripheral>
