0xsmirk/mcu_cmsis_svd/Spansion/MB9BF46xx.svd
        <!-- REGISTER "WTYR" -->
        <register>
          <name>WTYR</name>
          <description> register WTYR </description>
          <addressOffset>0x134</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TY" -->
            <field>
              <name>TY</name>
              <description> bitfield TY </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Y" -->
            <field>
              <name>Y</name>
              <description> bitfield Y </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMIR" -->
        <register>
          <name>ALMIR</name>
          <description> register ALMIR </description>
          <addressOffset>0x138</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMI" -->
            <field>
              <name>TAMI</name>
              <description> bitfield TAMI </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMI" -->
            <field>
              <name>AMI</name>
              <description> bitfield AMI </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALHR" -->
        <register>
          <name>ALHR</name>
          <description> register ALHR </description>
          <addressOffset>0x13C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAH" -->
            <field>
              <name>TAH</name>
              <description> bitfield TAH </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AH" -->
            <field>
              <name>AH</name>
              <description> bitfield AH </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALDR" -->
        <register>
          <name>ALDR</name>
          <description> register ALDR </description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAD" -->
            <field>
              <name>TAD</name>
              <description> bitfield TAD </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD" -->
            <field>
              <name>AD</name>
              <description> bitfield AD </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMOR" -->
        <register>
          <name>ALMOR</name>
          <description> register ALMOR </description>
          <addressOffset>0x144</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMO0" -->
            <field>
              <name>TAMO0</name>
              <description> bitfield TAMO0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMO" -->
            <field>
              <name>AMO</name>
              <description> bitfield AMO </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALYR" -->
        <register>
          <name>ALYR</name>
          <description> register ALYR </description>
          <addressOffset>0x148</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAY" -->
            <field>
              <name>TAY</name>
              <description> bitfield TAY </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AY" -->
            <field>
              <name>AY</name>
              <description> bitfield AY </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR0" -->
        <register>
          <name>WTTR0</name>
          <description> register WTTR0 </description>
          <addressOffset>0x14C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM7" -->
            <field>
              <name>TM7</name>
              <description> bitfield TM7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM6" -->
            <field>
              <name>TM6</name>
              <description> bitfield TM6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM5" -->
            <field>
              <name>TM5</name>
              <description> bitfield TM5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM4" -->
            <field>
              <name>TM4</name>
              <description> bitfield TM4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM3" -->
            <field>
              <name>TM3</name>
              <description> bitfield TM3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM2" -->
            <field>
              <name>TM2</name>
              <description> bitfield TM2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM1" -->
            <field>
              <name>TM1</name>
              <description> bitfield TM1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM0" -->
            <field>
              <name>TM0</name>
              <description> bitfield TM0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR1" -->
        <register>
          <name>WTTR1</name>
          <description> register WTTR1 </description>
          <addressOffset>0x150</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM15" -->
            <field>
              <name>TM15</name>
              <description> bitfield TM15 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM14" -->
            <field>
              <name>TM14</name>
              <description> bitfield TM14 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM13" -->
            <field>
              <name>TM13</name>
              <description> bitfield TM13 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM12" -->
            <field>
              <name>TM12</name>
              <description> bitfield TM12 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM11" -->
            <field>
              <name>TM11</name>
              <description> bitfield TM11 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM10" -->
            <field>
              <name>TM10</name>
              <description> bitfield TM10 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM9" -->
            <field>
              <name>TM9</name>
              <description> bitfield TM9 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM8" -->
            <field>
              <name>TM8</name>
              <description> bitfield TM8 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR2" -->
        <register>
          <name>WTTR2</name>
          <description> register WTTR2 </description>
          <addressOffset>0x154</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM17" -->
            <field>
              <name>TM17</name>
              <description> bitfield TM17 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM16" -->
            <field>
              <name>TM16</name>
              <description> bitfield TM16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL0" -->
        <register>
          <name>WTCAL0</name>
          <description> register WTCAL0 </description>
          <addressOffset>0x158</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL0" -->
            <field>
              <name>WTCAL0</name>
              <description> bitfield WTCAL0 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
