0xsmirk/mcu_cmsis_svd/Spansion/MB9BF46xx.svd
        <!-- REGISTER "BREG3F" -->
        <register>
          <name>BREG3F</name>
          <description> register BREG3F </description>
          <addressOffset>0x23F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG40" -->
        <register>
          <name>BREG40</name>
          <description> register BREG40 </description>
          <addressOffset>0x240</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG41" -->
        <register>
          <name>BREG41</name>
          <description> register BREG41 </description>
          <addressOffset>0x241</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG42" -->
        <register>
          <name>BREG42</name>
          <description> register BREG42 </description>
          <addressOffset>0x242</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG43" -->
        <register>
          <name>BREG43</name>
          <description> register BREG43 </description>
          <addressOffset>0x243</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG44" -->
        <register>
          <name>BREG44</name>
          <description> register BREG44 </description>
          <addressOffset>0x244</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG45" -->
        <register>
          <name>BREG45</name>
          <description> register BREG45 </description>
          <addressOffset>0x245</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG46" -->
        <register>
          <name>BREG46</name>
          <description> register BREG46 </description>
          <addressOffset>0x246</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG47" -->
        <register>
          <name>BREG47</name>
          <description> register BREG47 </description>
          <addressOffset>0x247</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG48" -->
        <register>
          <name>BREG48</name>
          <description> register BREG48 </description>
          <addressOffset>0x248</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG49" -->
        <register>
          <name>BREG49</name>
          <description> register BREG49 </description>
          <addressOffset>0x249</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4A" -->
        <register>
          <name>BREG4A</name>
          <description> register BREG4A </description>
          <addressOffset>0x24A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4B" -->
        <register>
          <name>BREG4B</name>
          <description> register BREG4B </description>
          <addressOffset>0x24B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4C" -->
        <register>
          <name>BREG4C</name>
          <description> register BREG4C </description>
          <addressOffset>0x24C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4D" -->
        <register>
          <name>BREG4D</name>
          <description> register BREG4D </description>
          <addressOffset>0x24D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4E" -->
        <register>
          <name>BREG4E</name>
          <description> register BREG4E </description>
          <addressOffset>0x24E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4F" -->
        <register>
          <name>BREG4F</name>
          <description> register BREG4F </description>
          <addressOffset>0x24F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG50" -->
        <register>
          <name>BREG50</name>
          <description> register BREG50 </description>
          <addressOffset>0x250</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG51" -->
        <register>
          <name>BREG51</name>
          <description> register BREG51 </description>
          <addressOffset>0x251</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG52" -->
        <register>
          <name>BREG52</name>
          <description> register BREG52 </description>
          <addressOffset>0x252</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
