0xsmirk/mcu_cmsis_svd/Spansion/MB9BF46xx.svd
        <!-- REGISTER "MODE3" -->
        <register derivedFrom="MODE0">
          <name>MODE3</name>
          <description> register MODE3 </description>
          <addressOffset>0xC</addressOffset>
        </register>
        <!-- REGISTER "MODE4" -->
        <register derivedFrom="MODE0">
          <name>MODE4</name>
          <description> register MODE4 </description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "MODE5" -->
        <register derivedFrom="MODE0">
          <name>MODE5</name>
          <description> register MODE5 </description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "MODE6" -->
        <register derivedFrom="MODE0">
          <name>MODE6</name>
          <description> register MODE6 </description>
          <addressOffset>0x18</addressOffset>
        </register>
        <!-- REGISTER "MODE7" -->
        <register derivedFrom="MODE0">
          <name>MODE7</name>
          <description> register MODE7 </description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <!-- REGISTER "TIM0" -->
        <register>
          <name>TIM0</name>
          <description> register TIM0 </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x055FF00F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WIDLC" -->
            <field>
              <name>WIDLC</name>
              <description> bitfield WIDLC </description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WWEC" -->
            <field>
              <name>WWEC</name>
              <description> bitfield WWEC </description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WADC" -->
            <field>
              <name>WADC</name>
              <description> bitfield WADC </description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WACC" -->
            <field>
              <name>WACC</name>
              <description> bitfield WACC </description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIDLC" -->
            <field>
              <name>RIDLC</name>
              <description> bitfield RIDLC </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRADC" -->
            <field>
              <name>FRADC</name>
              <description> bitfield FRADC </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RADC" -->
            <field>
              <name>RADC</name>
              <description> bitfield RADC </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RACC" -->
            <field>
              <name>RACC</name>
              <description> bitfield RACC </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIM1" -->
        <register derivedFrom="TIM0">
          <name>TIM1</name>
          <description> register TIM1 </description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "TIM2" -->
        <register derivedFrom="TIM0">
          <name>TIM2</name>
          <description> register TIM2 </description>
          <addressOffset>0x28</addressOffset>
        </register>
        <!-- REGISTER "TIM3" -->
        <register derivedFrom="TIM0">
          <name>TIM3</name>
          <description> register TIM3 </description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "TIM4" -->
        <register derivedFrom="TIM0">
          <name>TIM4</name>
          <description> register TIM4 </description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "TIM5" -->
        <register derivedFrom="TIM0">
          <name>TIM5</name>
          <description> register TIM5 </description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "TIM6" -->
        <register derivedFrom="TIM0">
          <name>TIM6</name>
          <description> register TIM6 </description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "TIM7" -->
        <register derivedFrom="TIM0">
          <name>TIM7</name>
          <description> register TIM7 </description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "AREA0" -->
        <register>
          <name>AREA0</name>
          <description> register AREA0 </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0000</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA1" -->
        <register>
          <name>AREA1</name>
          <description> register AREA1 </description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0010</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
